#Туристические агентства предлагают следующие туры.
#Вояж – Мексика,Канада,Израиль,Италия.
#РейнаТур – Англия,Япония,Канада,ЮАР.
#Определить:
#1. какие туры из Вояж, отсутствуют в РейнаТур.
#2. какие товары из РейнаТур, отсутствуют в Вояж.
#3. перечень одинаковых туров.
#4. равны ли перечни туров.

#Делать через множество, не через списки.


Вояж = {"Мексика", "Канада", "Израиль", "Италия"}
РейнаТур = {"Англия", "Япония", "Канада", "ЮАР"}





print("Задание 1")
#1
print(Вояж-РейнаТур)

print("Задание 2")
#2


print("Задание 3")
#3


print("Задание 4")
#4

